In [2]:
import pandas as pd

C:\Users\lpgn\AppData\Local\Temp\ipykernel_10092\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [3]:
#Existem diferentes formas de se ter dados utilizando o pandas, uma dessas formas é com a utilização de dicionários e listas:
dados = {
    'Nome': ['Max', 'Bella', 'Rocky', 'Luna'],
    'Raça': ['Labrador', 'Poodle', 'Boxer', 'Golder Retriever'],
    'Cor': ['Amarelo', 'Branco', 'Marrom', 'Dourado'],
    'Peso (kg)': [60,35,35,55],
    'Altura (cm)': [30,7,28,25],
    'Data de Nascimento': ['01/05/2018', '10/12/2019', '03/08/2017', '12/02/2016']
}

In [5]:
#Criando o dataframe
df_cachorros = pd.DataFrame(dados)
df_cachorros

    Nome              Raça      Cor  Peso (kg)  Altura (cm) Data de Nascimento
0    Max          Labrador  Amarelo         60           30         01/05/2018
1  Bella            Poodle   Branco         35            7        10/112/2019
2  Rocky             Boxer   Marrom         35           28         03/08/2017
3   Luna  Golder Retriever  Dourado         55           25         12/02/2016

In [6]:
#Lendo um arquivo e transformando em dataframe
# df_csv = pd.read_csv('arquivo.csv)
# df_excel = pd.read_excel('planilha.xlsx', sheet_name='nome_da_planilha)
# df_jason = pd.read_json('arquivo.json')
# df_parquet = pd.read_parquet('arquivo.parquet')
# from sqlalchemy import create_engine
# engine = create_engine('sqlite://banco_de_dados.bd')
# query = 'SELECT * FROM tabela'
# df_sql = pd.read_sql(query, engine)

Primeiros métodos para entender o dataframe

In [7]:
#visualizar os pontos iniciais de uma tabela: 
df_cachorros.head()

    Nome              Raça      Cor  Peso (kg)  Altura (cm) Data de Nascimento
0    Max          Labrador  Amarelo         60           30         01/05/2018
1  Bella            Poodle   Branco         35            7        10/112/2019
2  Rocky             Boxer   Marrom         35           28         03/08/2017
3   Luna  Golder Retriever  Dourado         55           25         12/02/2016

In [8]:
# df.info informa as colunas das tabelas e há dado faltante
df_cachorros.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Nome                4 non-null      object
 1   Raça                4 non-null      object
 2   Cor                 4 non-null      object
 3   Peso (kg)           4 non-null      int64
 4   Altura (cm)         4 non-null      int64
 5   Data de Nascimento  4 non-null      object
dtypes: int64(2), object(4)
memory usage: 324.0+ bytes

In [10]:
# df.shape informa o tamanho
df_cachorros.shape

(4, 6)

In [12]:
#df.describe informa valores e calculos e estatisticas
df_cachorros.describe()

       Peso (kg)  Altura (cm)
count   4.000000     4.000000
mean   46.250000    22.500000
std    13.149778    10.535654
min    35.000000     7.000000
25%    35.000000    20.500000
50%    45.000000    26.500000
75%    56.250000    28.500000
max    60.000000    30.000000

Componentes de um dataframe

In [14]:
# As tabelas no pandas funcionam com três pilares:
# .values -> os valores (que são os próprios dados)
df_cachorros.values

array([['Max', 'Labrador', 'Amarelo', 60, 30, '01/05/2018'],
       ['Bella', 'Poodle', 'Branco', 35, 7, '10/112/2019'],
       ['Rocky', 'Boxer', 'Marrom', 35, 28, '03/08/2017'],
       ['Luna', 'Golder Retriever', 'Dourado', 55, 25, '12/02/2016']],
      dtype=object)

In [15]:
# .columns -> as etiquetas (labels) das colunas
df_cachorros.columns

Index(['Nome', 'Raça', 'Cor', 'Peso (kg)', 'Altura (cm)',
       'Data de Nascimento'],
      dtype='object')

In [16]:
# .index -> as etiquetas das linhas
df_cachorros.index

RangeIndex(start=0, stop=4, step=1)

Ordenação e subconjuntos

In [18]:
#ordenação -> ordena a tabela conforme o parâmetro passado. no caso abaixo, conforme a altura.
df_cachorros.sort_values('Altura (cm)')

    Nome              Raça      Cor  Peso (kg)  Altura (cm) Data de Nascimento
1  Bella            Poodle   Branco         35            7        10/112/2019
3   Luna  Golder Retriever  Dourado         55           25         12/02/2016
2  Rocky             Boxer   Marrom         35           28         03/08/2017
0    Max          Labrador  Amarelo         60           30         01/05/2018

In [19]:
#ordenação descresncente-> ordena a tabela conforme o parâmetro passado. no caso abaixo, conforme a altura.
df_cachorros.sort_values('Altura (cm)', ascending=False)

    Nome              Raça      Cor  Peso (kg)  Altura (cm) Data de Nascimento
0    Max          Labrador  Amarelo         60           30         01/05/2018
2  Rocky             Boxer   Marrom         35           28         03/08/2017
3   Luna  Golder Retriever  Dourado         55           25         12/02/2016
1  Bella            Poodle   Branco         35            7        10/112/2019

In [20]:
#ordenação por multiplas variáveis-> ordena a tabela conforme o parâmetro passado. no caso abaixo, 
#conforme a altura e peso. Neste caso, é primeiro o peso e depois a altura
df_cachorros.sort_values(['Altura (cm)', 'Peso (kg)'])

    Nome              Raça      Cor  Peso (kg)  Altura (cm) Data de Nascimento
1  Bella            Poodle   Branco         35            7        10/112/2019
3   Luna  Golder Retriever  Dourado         55           25         12/02/2016
2  Rocky             Boxer   Marrom         35           28         03/08/2017
0    Max          Labrador  Amarelo         60           30         01/05/2018

In [21]:
#ordenação por multiplas variáveis descresncete-> ordena a tabela conforme o parâmetro passado. no caso abaixo, 
#conforme a altura e peso. Neste caso, é primeiro o peso e depois a altura
df_cachorros.sort_values(['Altura (cm)', 'Peso (kg)'], ascending=False)

    Nome              Raça      Cor  Peso (kg)  Altura (cm) Data de Nascimento
0    Max          Labrador  Amarelo         60           30         01/05/2018
2  Rocky             Boxer   Marrom         35           28         03/08/2017
3   Luna  Golder Retriever  Dourado         55           25         12/02/2016
1  Bella            Poodle   Branco         35            7        10/112/2019

In [22]:
#ordenação por multiplas variáveis crescente e descrescente-> ordena a tabela conforme o parâmetro passado. no caso abaixo, 
#conforme a altura e peso. Neste caso, é primeiro o peso e depois a altura
#Neste caso, altura é crescente e peso é decrescente
df_cachorros.sort_values(['Altura (cm)', 'Peso (kg)'], ascending=[True, False])

    Nome              Raça      Cor  Peso (kg)  Altura (cm) Data de Nascimento
1  Bella            Poodle   Branco         35            7        10/112/2019
3   Luna  Golder Retriever  Dourado         55           25         12/02/2016
2  Rocky             Boxer   Marrom         35           28         03/08/2017
0    Max          Labrador  Amarelo         60           30         01/05/2018

Subconjuntos de colunas

In [23]:
#subconjunto de apenas uma coluna
df_cachorros['Nome']

0      Max
1    Bella
2    Rocky
3     Luna
Name: Nome, dtype: object

In [24]:
#subconjunto de multiplas coluns
df_cachorros[['Nome', 'Altura (cm)']]

    Nome  Altura (cm)
0    Max           30
1  Bella            7
2  Rocky           28
3   Luna           25

In [29]:
#Subconjuntos de uma única linha
df_cachorros['Altura (cm)'] > 25

0     True
1    False
2     True
3    False
Name: Altura (cm), dtype: bool

In [30]:
#Uma condição lógica também pode ser aplicada para imprimir apenas os que são verdadeiros
df_cachorros[df_cachorros['Altura (cm)']> 25]

    Nome      Raça      Cor  Peso (kg)  Altura (cm) Data de Nascimento
0    Max  Labrador  Amarelo         60           30         01/05/2018
2  Rocky     Boxer   Marrom         35           28         03/08/2017

In [31]:
#Subconjunto com base em dado de texto
df_cachorros[df_cachorros['Raça'] == 'Boxer']

    Nome   Raça     Cor  Peso (kg)  Altura (cm) Data de Nascimento
2  Rocky  Boxer  Marrom         35           28         03/08/2017

In [32]:
df_cachorros[df_cachorros['Data de Nascimento'] < '12/05/2017']

    Nome              Raça      Cor  Peso (kg)  Altura (cm) Data de Nascimento
0    Max          Labrador  Amarelo         60           30         01/05/2018
1  Bella            Poodle   Branco         35            7        10/112/2019
2  Rocky             Boxer   Marrom         35           28         03/08/2017
3   Luna  Golder Retriever  Dourado         55           25         12/02/2016

In [33]:
#Subconjunto com base em múltiplas condições
is_labrador = df_cachorros['Raça'] == 'Labrador'
is_amarelo = df_cachorros['Cor'] == 'Amarelo'
df_cachorros [is_labrador&is_amarelo]

  Nome      Raça      Cor  Peso (kg)  Altura (cm) Data de Nascimento
0  Max  Labrador  Amarelo         60           30         01/05/2018

In [34]:
df_cachorros[(df_cachorros['Raça']=='Labrador') & (df_cachorros['Cor'] == 'Amarelo')]

  Nome      Raça      Cor  Peso (kg)  Altura (cm) Data de Nascimento
0  Max  Labrador  Amarelo         60           30         01/05/2018

In [35]:
#Subconjunto usando .isin() -> retorno aquilo que filtro
is_marrom_ou_branco = df_cachorros['Cor'].isin(['Marrom', 'Branco'])
df_cachorros[is_marrom_ou_branco]

    Nome    Raça     Cor  Peso (kg)  Altura (cm) Data de Nascimento
1  Bella  Poodle  Branco         35            7        10/112/2019
2  Rocky   Boxer  Marrom         35           28         03/08/2017

Adicionando uma nova coluna no dataframe

In [36]:
#Criar uma nova coluna é como se estivesse adicionando uma nova 'característica'
df_cachorros['Altura (m)'] = df_cachorros['Altura (cm)']/100
df_cachorros

,Nome,Raça,Cor,Peso (kg),Altura (cm),Data de Nascimento,Altura (m)
0,Max,Labrador,Amarelo,60,30,01/05/2018,0.30
1,Bella,Poodle,Branco,35,7,10/112/2019,0.07
2,Rocky,Boxer,Marrom,35,28,03/08/2017,0.28
3,Luna,Golder Retriever,Dourado,55,25,12/02/2016,0.25

In [37]:
#Multiplas manipulações -> multiplos filtros
dog_pequeno = df_cachorros[df_cachorros['Altura (m)']<=0.5]
dog_pequeno = dog_pequeno.sort_values('Altura (cm)', ascending=False)
dog_pequeno[['Nome', 'Altura (cm)', 'Peso (kg)']]

    Nome  Altura (cm)  Peso (kg)
0    Max           30         60
2  Rocky           28         35
3   Luna           25         55
1  Bella            7         35